# imports

In [1]:
import numpy as np
import pandas as pd

In [4]:
a = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(a)

a    10
b    20
c    30
dtype: int64

In [6]:
a = [10, 20, 30, 40, 50]
df = pd.DataFrame(a)
df

    0
0  10
1  20
2  30
3  40
4  50

In [11]:
a = [['Srinivas', 97], ['Vase', 89], ['Nivas', 90]]

# print(a)
df = pd.DataFrame(a, columns=['Name', 'Marks'])

df
type(df)

pandas.core.frame.DataFrame

In [21]:
# print only column
c = df[['Name']]
type(c)

pandas.core.frame.DataFrame

In [24]:
a = {'Name': ['Srinivas', 'Vasu'], 'Age':[35, 40]}
pd.DataFrame(a)

       Name  Age
0  Srinivas   35
1      Vasu   40